<template>
  <div :style="{ height, width }">
    <div class="inherit" />
  </div>
</template>

<script>
import echartsMixin from './mixins'

export default {
  name: 'MultiPart',
  mixins: [echartsMixin],
  props: {
    config: {
      type: Object,
      required: true,
    },
    data: {
      type: Object,
      required: false,
      default: () => {
        return {
          title:"多成分图",
          tooltip: {
            trigger: 'axis',
            axisPointer: {
              type: 'cross',
              crossStyle: {
                color: '#999',
              },
            },
          },
          toolbox: {
            feature: {
              dataView: { show: true, readOnly: false },
              magicType: { show: true, type: ['line', 'bar'] },
              restore: { show: true },
              saveAsImage: { show: true },
            },
          },
          legend: {
          },
          xAxis: {
            type: 'category',
          },
          yAxis: {},
          series: [
            {
              "stack": "all",
              "type": "bar"
            },
            {
              "stack": "all",
              "type": "bar"
            }
          ],
          dataset: {
            source: [
              {
                "发布年份": "1976",
                "制定": 1
              },
              {
                "发布年份": "1975",
                "制定": 3
              },
              {
                "发布年份": "1974",
                "制定": 1
              },
              {
                "发布年份": "1972",
                "修订": 1,
                "制定": 1
              },
              {
                "发布年份": "1979",
                "制定": 2
              },
              {
                "发布年份": "1978",
                "制定": 2
              },
              {
                "发布年份": "1977",
                "制定": 6
              },
              {
                "发布年份": "1990",
                "修订": 13,
                "制定": 4
              },
              {
                "发布年份": "2001",
                "修订": 38,
                "制定": 13
              },
              {
                "发布年份": "2000",
                "修订": 30,
                "制定": 10
              },
              {
                "发布年份": "1987",
                "修订": 3,
                "制定": 8
              },
              {
                "发布年份": "1986",
                "修订": 1,
                "制定": 11
              },
              {
                "发布年份": "1985",
                "修订": 1,
                "制定": 8
              },
              {
                "发布年份": "1984",
                "修订": 1,
                "制定": 8
              },
              {
                "发布年份": "1983",
                "修订": 2,
                "制定": 5
              },
              {
                "发布年份": "1982",
                "修订": 2,
                "制定": 3
              },
              {
                "发布年份": "1981",
                "制定": 4
              },
              {
                "发布年份": "1980",
                "制定": 6
              },
              {
                "发布年份": "1989",
                "修订": 7,
                "制定": 7
              },
              {
                "发布年份": "1988",
                "修订": 4,
                "制定": 15
              },
              {
                "发布年份": "2012",
                "修订": 80,
                "制定": 21
              },
              {
                "发布年份": "2011",
                "修订": 71,
                "制定": 25
              },
              {
                "发布年份": "2010",
                "修订": 77,
                "制定": 26
              },
              {
                "发布年份": "1998",
                "修订": 30,
                "制定": 6
              },
              {
                "发布年份": "2009",
                "修订": 44,
                "制定": 26
              },
              {
                "发布年份": "1997",
                "修订": 34,
                "制定": 9
              },
              {
                "发布年份": "2008",
                "修订": 53,
                "制定": 25
              },
              {
                "发布年份": "1996",
                "修订": 27,
                "制定": 7
              },
              {
                "发布年份": "2007",
                "修订": 71,
                "制定": 21
              },
              {
                "发布年份": "1995",
                "修订": 17,
                "制定": 16
              },
              {
                "发布年份": "2006",
                "修订": 39,
                "制定": 22
              },
              {
                "发布年份": "1994",
                "修订": 16,
                "制定": 2
              },
              {
                "发布年份": "2005",
                "修订": 32,
                "制定": 16
              },
              {
                "发布年份": "1993",
                "修订": 17,
                "制定": 6
              },
              {
                "发布年份": "2004",
                "修订": 32,
                "制定": 19
              },
              {
                "发布年份": "1992",
                "修订": 7,
                "制定": 6
              },
              {
                "发布年份": "2003",
                "修订": 27,
                "制定": 9
              },
              {
                "发布年份": "1991",
                "修订": 15,
                "制定": 5
              },
              {
                "发布年份": "2002",
                "修订": 31,
                "制定": 10
              },
              {
                "发布年份": "1999",
                "修订": 27,
                "制定": 4
              },
              {
                "发布年份": "2021",
                "修订": 162,
                "制定": 16
              },
              {
                "发布年份": "2020",
                "修订": 261,
                "制定": 46
              },
              {
                "发布年份": "2019",
                "修订": 177,
                "制定": 64
              },
              {
                "发布年份": "2018",
                "修订": 139,
                "制定": 57
              },
              {
                "发布年份": "2017",
                "修订": 158,
                "制定": 45
              },
              {
                "发布年份": "2016",
                "修订": 128,
                "制定": 32
              },
              {
                "发布年份": "2015",
                "修订": 100,
                "制定": 30
              },
              {
                "发布年份": "2014",
                "修订": 105,
                "制定": 35
              },
              {
                "发布年份": "2013",
                "修订": 83,
                "制定": 21
              },
              {
                "发布年份": "1966",
                "制定": 1
              }
            ],
            dimensions: [
              "发布年份",
              "修订",
              "制定"
            ]
          }
        }
      },
    },
  },
  data() {
    return {
      baseConfig: {
        title: {},
        tooltip: {},
        toolbox: {},
        grid: {},
        legend: {},
        xAxis: {},
        yAxis: {},
        series: {},
        dataset:{},
      },
      media: [
        {
          query: {
            maxWidth: 500,
          },
          option: {
            xAxis: {
              axisLabel: {
                rotate: 45,
              },
              nameGap: 0,
            },
            series: {
              label: {
                show: false,
              },
              emphasis: {
                label: {
                  show: false,
                },
              },
            },
          },
        },
      ],
    }
  },
  methods: {
    dataClean() {
      const { data } = this
      const text = data.title
      data.title = {
        text,
      }
      this.initChart(data)
    },
  },
}
</script>
